// Тимур - старт - 18.03.2020
&НаСервереБезКонтекста
Процедура ДозаполнитьНаСервере(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОприходованиеТоваров.Ссылка КАК Ссылка,
	|	ОприходованиеТоваров.Представление КАК Представление
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.Дата >= &ДатаНачала
	|	И ОприходованиеТоваров.Дата <= &ДатаОкончания");
	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Штука = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("870");
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект	= Выборка.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.СтатьяПрочихДоходовРасходов	= Справочники.ПрочиеДоходыИРасходы.ВнереализационныеДоходыПоИнвентаризации;
		
		Для каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
			
			СтрокаТЧ.ЕдиницаИзмерения	= Штука;
			СтрокаТЧ.Коэффициент		= 1;
			
		КонецЦикла;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента[?(ДокументОбъект.Проведен, "Проведение", "Запись")]);
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Ошибка записи документа " + Выборка.Представление + ": " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщение		= Новый СообщениеПользователю;
	Сообщение.Текст	= "Обработка документов завершена.";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура Дозаполнить(Команда)
	ДозаполнитьНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания);
КонецПроцедуры

// финиш - 18.03.2020
