// Тимур - старт - 28 мая 2020 г.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	ОбъектыНазначения				= Параметры.ОбъектыНазначения;
//	КоличествоОбъектовНазначения	= ОбъектыНазначения.Количество();
//	Если КоличествоОбъектовНазначения = 1 Тогда
//		Документ	= ОбъектыНазначения[0]; 
//	Иначе
//		Отказ		= Истина;
//	КонецЕсли;		
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере(Документ, Объект.РаспределенныеЗатраты);
	Модифицированность	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросПриЗакрытииЗавершение", ЭтотОбъект),
			"В таблице ""Распределяемые затраты"" присутствуют несохраненные данные. При закрытии формы они будут потеряны. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПриЗакрытииЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНаСервере(Знач ДокументСсылка, Знач РаспределенныеЗатраты)

	ТЗДляЗаписи	= Новый ТаблицаЗначений;
	Колонки		= ТЗДляЗаписи.Колонки;
	Колонки.Добавить("Свойство");
	Колонки.Добавить("Значение");
	
	ДополнительныеРеквизитыИСведенияМенеджер	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения;
	Префикс										= ДокументСсылка.Метаданные().Имя + "_"; 
	
	Для Каждого СтрокаТЧ Из РаспределенныеЗатраты Цикл
		
		ИмяДопСвойства	= "Строка" + Формат(СтрокаТЧ.НомерСтроки, "ЧЦ=5; ЧВН=; ЧГ=;");
		ДопСвойство		= ДополнительныеРеквизитыИСведенияМенеджер.НайтиПоРеквизиту("Имя", Префикс + ИмяДопСвойства);
		
		НоваяСтрока				= ТЗДляЗаписи.Добавить();
		НоваяСтрока.Свойство	= ДопСвойство;
		НоваяСтрока.Значение	= "333333"; 
		
	КонецЦикла;
	
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ДокументСсылка, ТЗДляЗаписи);
	
КонецПроцедуры

#КонецОбласти

// финиш - 28 мая 2020 г.
