
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ПланПоВсемуПроекту.Записывать = Истина;
	Движения.ПланПоВсемуПроекту.Очистить();
	Для Каждого СтрокаТЧ Из Выполнение Цикл
		Движение = Движения.ПланПоВсемуПроекту.Добавить();
		Движение.Период = Дата;
		Движение.Подрядчик = СтрокаТЧ.Подрядчик;
		Движение.Титул = СтрокаТЧ.Титул;
		Движение.ШифрПроекта = СтрокаТЧ.ШифрПроекта;
		Движение.ЛокальнаяСмета = СтрокаТЧ.НомерЛокальнойСметы;
		Движение.СМР = СтрокаТЧ.НаименованиеСМР;
		Движение.ЕдИзм = СтрокаТЧ.ЕдиницаИзмерения;
		Движение.ПланОбъёмВыполнения = СтрокаТЧ.Объём;
	КонецЦикла;
	Движения.ДатаИзмененияПланаПоПроекту.Записывать = Истина;
	Движения.ДатаИзмененияПланаПоПроекту.Очистить();
	Движение = Движения.ДатаИзмененияПланаПоПроекту.Добавить();
	Движение.Период = Дата;
	Движение.Подрядчик = СтрокаТЧ.Подрядчик;
	Движение.Титул = СтрокаТЧ.Титул;
	Движение.ШифрПроекта = СтрокаТЧ.ШифрПроекта;
	Движение.ЛокальнаяСмета = СтрокаТЧ.НомерЛокальнойСметы;
	Движение.СМР = СтрокаТЧ.НаименованиеСМР;
	Движение.ЕдИзм = СтрокаТЧ.ЕдиницаИзмерения;
	Движение.ДатаИзма = Дата;
КонецПроцедуры
