// Тимур - старт - 28 мая 2020 г.
Функция СведенияОВнешнейОбработке() Экспорт
    
	ПараметрыРегистрации		= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид	= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиСозданиеСвязанныхОбъектов();
	ПараметрыРегистрации.Версия	= "01.02";
	
    ПараметрыРегистрации.Назначение.Добавить("Документ.АвансовыйОтчет");
    ПараметрыРегистрации.Назначение.Добавить("Документ.ОперацияБух");
    ПараметрыРегистрации.Назначение.Добавить("Документ.ПоступлениеТоваровУслуг");
    // Тимур - старт - 3 июн. 2020 г.
    ПараметрыРегистрации.Назначение.Добавить("Документ.ТребованиеНакладная");
    // финиш - 3 июн. 2020 г.
            
	Команда							= ПараметрыРегистрации.Команды.Добавить();
	
	Команда.Представление			= НСтр("ru = 'Распределение затрат'");
	Команда.Идентификатор			= "РаспределениеЗатрат";
	Команда.Использование			= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение	= Истина;
	
	Возврат ПараметрыРегистрации;
    
КонецФункции
// финиш - 28 мая 2020 г.