
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СуточныйГрафик 
	Движения.СуточныйГрафик.Записывать = Истина;
	Движения.СуточныйГрафик.Очистить();
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		// Проверка на КонецПериода и НачалоПериода
		Если ТекСтрокаТабличнаяЧасть1.КонецПериода<ТекСтрокаТабличнаяЧасть1.НачалоПериода Тогда
			Сообщить("Ошибка в периодах: дата окончания меньще даты начала");
			
		КонецЕсли;
		КоличествоДнейВыполнения = 1+(НачалоДня(ТекСтрокаТабличнаяЧасть1.КонецПериода)-НачалоДня(ТекСтрокаТабличнаяЧасть1.НачалоПериода))/(86400);//24*60*60
		СуточноеВыполнение = ТекСтрокаТабличнаяЧасть1.ОбъёмВыполнения/КоличествоДнейВыполнения;
		//Для ТекДеньВыполнения=ТекСтрокаТабличнаяЧасть1.НачалоПериода По ТекСтрокаТабличнаяЧасть1.КонецПериода Цикл
		ТекДеньВыполнения = ТекСтрокаТабличнаяЧасть1.НачалоПериода;
		Для НомерДня=1 По КоличествоДнейВыполнения Цикл
			Движение = Движения.СуточныйГрафик.Добавить();
			Движение.Период = ТекДеньВыполнения;
			Движение.ШифрПроекта = ТекСтрокаТабличнаяЧасть1.ШифрПроекта;
			Движение.ЛокальнаяСмета = ТекСтрокаТабличнаяЧасть1.ЛокальнаяСмета;
			Движение.СМР = ТекСтрокаТабличнаяЧасть1.НаименованиеСМР;
			Движение.ЕдИзм = ТекСтрокаТабличнаяЧасть1.ЕдиницаИзмерения;
			Движение.ДатаВыполнения = ТекДеньВыполнения;
			Движение.ПланОбъёмВыполнения = СуточноеВыполнение;
			//
			ТекДеньВыполнения = КонецДня(ТекДеньВыполнения)+1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
