
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СуточныйГрафик 
	Движения.СуточныйГрафик.Записывать = Истина;
	Движения.СуточныйГрафик.Очистить();
	Для Каждого СтрокаТЧ Из Выполнение Цикл
		// Проверка на КонецПериода и НачалоПериода
		Если СтрокаТЧ.КонецПериода<СтрокаТЧ.НачалоПериода Тогда
			Сообщить("Ошибка в периодах: дата окончания меньше даты начала");
		КонецЕсли;
		КоличествоДнейВыполнения = 1+(НачалоДня(СтрокаТЧ.КонецПериода)-НачалоДня(СтрокаТЧ.НачалоПериода))/86400;//24*60*60
		СуточноеВыполнение = СтрокаТЧ.ОбъёмВыполнения/КоличествоДнейВыполнения;
		//Для ТекДеньВыполнения=СтрокаТЧ.НачалоПериода По СтрокаТЧ.КонецПериода Цикл
		ТекДеньВыполнения = СтрокаТЧ.НачалоПериода;
		Для НомерДня=1 По КоличествоДнейВыполнения Цикл
			Движение = Движения.СуточныйГрафик.Добавить();
			Движение.Период = ТекДеньВыполнения;
			Движение.Подрядчик = СтрокаТЧ.Подрядчик;
			Движение.Титул = СтрокаТЧ.Титул;
			Движение.ШифрПроекта = СтрокаТЧ.ШифрПроекта;
			Движение.ЛокальнаяСмета = СтрокаТЧ.ЛокальнаяСмета;
			Движение.СМР = СтрокаТЧ.НаименованиеСМР;
			Движение.ЕдИзм = СтрокаТЧ.ЕдиницаИзмерения;
			Движение.ДатаВыполнения = ТекДеньВыполнения;
			Движение.ПланОбъёмВыполнения = СуточноеВыполнение;
			ТекДеньВыполнения = КонецДня(ТекДеньВыполнения)+1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
