// Тимур - старт - 15.04.2020

&НаСервереБезКонтекста
Процедура ИсправитьДокументыНаСервере(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа,
	// Тимур - старт - 07.05.2020
	//|	ПоступлениеНаРасчетныйСчет.Представление КАК Представление
	|	ПоступлениеНаРасчетныйСчет.Представление КАК Представление,
	|	ПоступлениеНаРасчетныйСчет.Контрагент.ИНН КАК ИННКонтрагента
	// финиш - 07.05.2020
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеНаРасчетныйСчет.Дата,
	|	ПоступлениеНаРасчетныйСчет.Номер");
	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект				= Выборка.Ссылка.ПолучитьОбъект();
		
		// Тимур - старт - 7 мая 2020 г.
		//ДокументОбъект.РасшифровкаПлатежа[0].СуммаУслуг	= ПолучитьСуммуКомиссии(Выборка.НазначениеПлатежа);
		ДокументОбъект.РасшифровкаПлатежа[0].СуммаУслуг	= ПолучитьСуммуКомиссии(Выборка.НазначениеПлатежа, Выборка.ИННКонтрагента);
		// финиш - 7 мая 2020 г.
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента[?(ДокументОбъект.Проведен, "Проведение", "Запись")]);
		Исключение
			Сообщение		= Новый СообщениеПользователю;
			Сообщение.Текст	= "Ошибка записи документа " + Выборка.Представление + ": " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщение		= Новый СообщениеПользователю;
	Сообщение.Текст	= "Обработка документов завершена.";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьДокументы(Команда)
	ИсправитьДокументыНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста

// Тимур - старт - 7 мая 2020 г.

//Функция ПолучитьСуммуКомиссии(Знач НазначениеПлатежа)
Функция ПолучитьСуммуКомиссии(Знач НазначениеПлатежа, Знач ИННКонтрагента)
// финиш - 7 мая 2020 г.
	
	Для Счетчик =-СтрДлина(НазначениеПлатежа) По -1 Цикл
		Позиция	= -Счетчик;
		Если СтрНайти("0123456789", Сред(НазначениеПлатежа, Позиция, 1)) Тогда
			ПозицияПоследнейЦифрыСуммыКомиссии = Позиция;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Подстрока			= Лев(НазначениеПлатежа, ПозицияПоследнейЦифрыСуммыКомиссии);
	
	// Тимур - старт - 7 мая 2020 г.
	
//	Для Счетчик =-СтрДлина(Подстрока) По -1 Цикл
//		Позиция	= -Счетчик;
//		Символ	= Сред(НазначениеПлатежа, Позиция, 1);
//		Если СтрНайти("0123456789.", Символ) И Символ = "." Тогда
//			СколькоНашлиТочек = СколькоНашлиТочек + 1;
//		КонецЕсли;
//		Если СколькоНашлиТочек = 2 Тогда
//			ПозицияПервойЦифрыСуммыКомиссии = Позиция + 1;
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;
	
	Если (СокрЛП(ИННКонтрагента) = "7702070139") Тогда
		// ВТБ24
		Для Счетчик = -СтрДлина(Подстрока) По -1 Цикл
			Позиция	= -Счетчик;
			Символ	= Сред(НазначениеПлатежа, Позиция, 1);
			Если СтрНайти("абвгдеёжзийклмнопрстуфхцчшщыъьэюя", Символ) Тогда
				ПозицияПервойЦифрыСуммыКомиссии = Позиция + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// УралСиб или Альфа-банк
		СколькоНашлиТочек	= 0;
		
		Для Счетчик = -СтрДлина(Подстрока) По -1 Цикл
			Позиция	= -Счетчик;
			Символ	= Сред(НазначениеПлатежа, Позиция, 1);
			Если СтрНайти("0123456789.", Символ) И Символ = "." Тогда
				СколькоНашлиТочек = СколькоНашлиТочек + 1;
			КонецЕсли;
			Если СколькоНашлиТочек = 2 Тогда
				ПозицияПервойЦифрыСуммыКомиссии = Позиция + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// финиш - 7 мая 2020 г.
	
	Возврат Число(СокрЛП(Сред(НазначениеПлатежа, ПозицияПервойЦифрыСуммыКомиссии, ПозицияПоследнейЦифрыСуммыКомиссии - ПозицияПервойЦифрыСуммыКомиссии + 1)));
	
КонецФункции // ПолучитьСуммуКомиссии()

// финиш - 15.04.2020
