
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СуточныйГрафик 
	Движения.СуточныйГрафик.Записывать = Истина;
	Движения.СуточныйГрафик.Очистить();
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		Движение = Движения.СуточныйГрафик.Добавить();
		Движение.Период = Дата;
		Движение.Подрядчик = ТекСтрокаТабличнаяЧасть1.Подрядчик;
		Движение.ШифрПроекта = ТекСтрокаТабличнаяЧасть1.ШифрПроекта;
		Движение.ЛокальнаяСмета = ТекСтрокаТабличнаяЧасть1.НомерЛокальнойСметы;
		Движение.СМР = ТекСтрокаТабличнаяЧасть1.НаименованиеСМР;
		Движение.ЕдИзм = ТекСтрокаТабличнаяЧасть1.ЕдиницаИзмерения;
		Движение.ДатаВыполнения = Дата;
		Движение.ФактОбъёмВыполнения = ТекСтрокаТабличнаяЧасть1.СуточныйОбъём;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
