// Тимур - старт - 05.03.2020
&НаСервереБезКонтекста
Процедура СоздатьПредопределенныйЭлементНаСервере(ИмяПредопределенногоЭлемента, ЭлементСправочника)
	
	ОбновляемыйОбъект							= ЭлементСправочника.ПолучитьОбъект();
	ОбновляемыйОбъект.ИмяПредопределенныхДанных	= ИмяПредопределенногоЭлемента;
	ОбновляемыйОбъект.ОбменДанными.Загрузка		= Истина;
	
	ОбновляемыйОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПредопределенныйЭлемент(Команда)
	
	СоздатьПредопределенныйЭлементНаСервере(ИмяПредопределенногоЭлемента, ЭлементСправочника);
	
	Сообщение		= Новый СообщениеПользователю;
	Сообщение.Текст	= "Готово!";
	Сообщение.Сообщить();
	
КонецПроцедуры
// финиш - 05.03.2020
