&НаКлиенте
Процедура Заполнить(Команда)
	ГодЗаполнения = Год(ТекущаяДата());
	Если ВвестиЧисло(ГодЗаполнения, "Укажите год для заполнения", 4, 0) Тогда
		ЗаполнитьНаСервере(ГодЗаполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(ГодЗаполнения)
	НаборЗаписей = РегистрыСведений.ПроизводственныйКалендарь.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ГодКалендаря.Установить(ГодЗаполнения);
	ОдинДень = 60*60*24;
	ТекДата = Дата(ГодЗаполнения, 1, 1);
	КонецПериода = КонецГода(ТекДата);
	Пока ТекДата <= КонецПериода Цикл
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ГодКалендаря = ГодЗаполнения; 
		НоваяЗапись.ДатаКалендаря = ТекДата;
		ТекДата = ТекДата + ОдинДень; 
	КонецЦикла; 
	НаборЗаписей.Записать();    		
КонецПроцедуры
