// Тимур - старт - 28 мая 2020 г.
&НаКлиенте
Процедура СоздатьДопСведения(Команда)
	СоздатьДопСведенияНаСервере(Объект.Источник, Объект.Количество, Объект.МаксимальныйНомер, Объект.НаборДопРеквизитовИСведений);
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Готово!'"));
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДопСведенияНаСервере(Источник, Количество, МаксимальныйНомер, НаборДопРеквизитовИСведений)
	НаборДопРеквизитовИСведенийОбъект	= НаборДопРеквизитовИСведений.ПолучитьОбъект();
	ТЧДопСведения						= НаборДопРеквизитовИСведенийОбъект.ДополнительныеСведения; 
	МаксимальныйНомерСтрока				= Формат(МаксимальныйНомер, "ЧЦ=5; ЧВН=; ЧГ=;");
	Заголовок							= Источник.Заголовок;
	Имя									= Источник.Имя; 
	Для Счетчик = МаксимальныйНомер + 1 По МаксимальныйНомер + Количество Цикл
		НомерЭлементаСтрока			= Формат(Счетчик, "ЧЦ=5; ЧВН=; ЧГ=;");
		НовыйЭлемент				= Источник.Скопировать();
		НовыйЭлемент.Наименование	= СтрЗаменить(НовыйЭлемент.Наименование, МаксимальныйНомерСтрока, НомерЭлементаСтрока);  
		НовыйЭлемент.Заголовок		= СтрЗаменить(Заголовок, МаксимальныйНомерСтрока, НомерЭлементаСтрока);  
		НовыйЭлемент.Имя			= СтрЗаменить(Имя, МаксимальныйНомерСтрока, НомерЭлементаСтрока);
		НовыйЭлемент.Записать();
		
		НовыйЭлементСсылка					= НовыйЭлемент.Ссылка;
				
		Если ТЧДопСведения.Найти(НовыйЭлементСсылка, "Свойство") = Неопределено Тогда
			НоваяСтрокаТЧДопСведения			= ТЧДопСведения.Добавить();
			НоваяСтрокаТЧДопСведения.Свойство	= НовыйЭлементСсылка; 
    	КонецЕсли;
		
	КонецЦикла;
    Если НаборДопРеквизитовИСведенийОбъект.Модифицированность() Тогда
		НаборДопРеквизитовИСведенийОбъект.Записать();
    КонецЕсли;
КонецПроцедуры
// финиш - 28 мая 2020 г.
